<?php

class FinalQuest
{

    // キャラクター
    public $name;
    protected $gender;

    //コンストラクタ
    public function __construct($name)
    {
        $this->name = $name;
    }

    public function opening()
    {
        echo 
       '□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□<br>
        ■■■■■■■■□■■■□□■■■□□■■■□□□□■□□□□□■□□□□□□□□□□■■■□□□□■■■□□■■■□■■■■■■■□□□□■■□■□□□■■■■■■■□□<br>
        □■□□□□□□□□■□□□□■□□□□■□□□□■□■□□□□■□□□□□□□□□■□□□■□□□□■□□□□■□□□■□□□□■□□□■□□■■□□□■□□■□□■□□<br>
        □■□□□□□□□□■□□□□■■□□□■□□□□■□■□□□□■□□□□□□□□□■□□□■□□□□■□□□□■□□□■□□□□■□□■□□□□■□□□■□□■□□■□□<br>
        □■□□□□□□□□■□□□□■□■□□■□□□□■□■□□□□■□□□□□□□□■□□□□□■□□□■□□□□■□□□■□□□□□□□■□□□□□□□□□□□■□□□□□<br>
        □■□□□□□□□□■□□□□■□■□□■□□□■□□□■□□□■□□□□□□□□■□□□□□■□□□■□□□□■□□□■□□■□□□□■□□□□□□□□□□□■□□□□□<br>
        □■■■■■□□□□■□□□□■□■□□■□□□■□□□■□□□■□□□□□□□□■□□□□□■□□□■□□□□■□□□■□□■□□□□□■■□□□□□□□□□■□□□□□<br>
        □■□□□□□□□□■□□□□■□■□□■□□□■□□□■□□□■□□□□□□□□■□□□□□■□□□■□□□□■□□□■■■■□□□□□□□■■□□□□□□□■□□□□□<br>
        □■□□□□□□□□■□□□□■□□■□■□□□■□□□■□□□■□□□□□□□□■□□□□□■□□□■□□□□■□□□■□□■□□□□□□□□□■□□□□□□■□□□□□<br>
        □■□□□□□□□□■□□□□■□□■□■□□□■■■■■□□□■□□□□□□□□■□□□□□■□□□■□□□□■□□□■□□■□□□□■□□□□□■□□□□□■□□□□□<br>
        □■□□□□□□□□■□□□□■□□□■■□□■□□□□□■□□■□□□□□□□□■□■■■□■□□□■□□□□■□□□■□□□□■□□■□□□□□■□□□□□■□□□□□<br>
        □■□□□□□□□□■□□□□■□□□■■□□■□□□□□■□□■□□□□□□□□□■□□□■□□□□■□□□□■□□□■□□□□■□□■□□□□□■□□□□□■□□□□□<br>
        □■□□□□□□□□■□□□□■□□□□■□□■□□□□□■□□■□□□□□■□□□■□□□■□□□□■□□□□■□□□■□□□□■□□■■□□□■□□□□□□■□□□□□<br>
        ■■■■□□□□□■■■□□■■■□□■■■□■■□□□■■□□■■■■■■■□□□□■■■□□□□□□■■■■□□□■■■■■■■□□■□■■■□□□□□■■■■■□□□<br>
        □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□<br>
        □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■■□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□<br><br>';
    }

    public function goRuidasBar()
    {
        echo $this->name . ' さん、いらっしゃい！<br>ここは冒険者の集まる酒場だよ。<br><br>' ;
    }

    public function makeParty($company, $gender)
    {
        echo $company . ' （性別： ' . $gender . '）を仲間にしますか？<br><br>';
        echo '▷はい<br>　いいえ<br><br>';
    }

    public function dontMakeParty($company, $gender)
    {
        echo $company . ' （性別： ' . $gender . '）を仲間にしますか？<br><br>';
        echo '　はい<br>▷いいえ<br><br>';
    }

    public function fight($monster)
    {
        echo $this->name . ' は、' . $monster . ' と遭遇した！<br>パーティーは全滅した・・・。<br><br><br><br><br>';
    }

    protected function quiz($food)
    {
        echo '池さんの好きな食べ物は何か？<br><br>';
        if ($food === '寿司') {
            echo '正解じゃ！<br><br><br><br><br><br>';
        } else {
            echo 'BAD END...<br><br><br><br><br><br>';
        }
    }

}


class HeavensQuest extends FinalQuest
{
  
    // コンストラクタをオーバーライド
    public function __construct($name)
    {
    echo 'おお、' . $name . ' よ。死んでしまうとは情けない。<br>
    この謎が解けたら、復活のチャンスを与えよう！<br><br>';
    }

    // protectedなメソッドを親クラスから呼び出し
    public function deadOrAlive($food)
    {
        $this->quiz($food);
    }
}

// // 親クラスをインスタンス化
// $game = new FinalQuest('');
// // インスタンスからプロパティへアクセス
// echo '名前を入力してください。<br><br>';
// // echo 'あなたの名前は ' . $game->name . ' ですね？<br><br>';
// // echo '▷はい<br>　いいえ<br><br>';
        
// // オープニング
// // インスタンスからメソッドへアクセス
// $game->opening();
// // とりあえずルイーダの酒場へ
// $game->goRuidasBar();
// // 仲間を集める
// $game->makeParty('戦士', '男');
// $game->makeParty('僧侶', '女');
// $game->makeParty('魔法使い', '女');
// $game->dontMakeParty('遊び人', '男');
// // モンスターと戦う
// $game->fight('スライム');

// // 子クラスをインスタンス化
// // コンストラクタをオーバーライド
// $miniGame = new HeavensQuest('');
// // ミニゲーム
// // protectedなメソッドを親クラスから呼び出したもの
// $miniGame->deadOrAlive('');

